blake-mh-liu/ADCU_TC387/tresos/plugins/McalExt_TS_T16DxM1I0R0/MCAL_Delivery/McIsar/Src/Infra_Prod/Sfr/TC32xA/_Reg/IfxCbs_bf.h
/** \brief Mask for Ifx_CBS_TRTGB_L_Bits.TG5 */
#define IFX_CBS_TRTGB_L_TG5_MSK (0xfu)

/** \brief Offset for Ifx_CBS_TRTGB_L_Bits.TG5 */
#define IFX_CBS_TRTGB_L_TG5_OFF (20u)

/** \brief Length for Ifx_CBS_TRTGB_L_Bits.TG6 */
#define IFX_CBS_TRTGB_L_TG6_LEN (4u)

/** \brief Mask for Ifx_CBS_TRTGB_L_Bits.TG6 */
#define IFX_CBS_TRTGB_L_TG6_MSK (0xfu)

/** \brief Offset for Ifx_CBS_TRTGB_L_Bits.TG6 */
#define IFX_CBS_TRTGB_L_TG6_OFF (24u)

/** \brief Length for Ifx_CBS_TRTGB_L_Bits.TG7 */
#define IFX_CBS_TRTGB_L_TG7_LEN (4u)

/** \brief Mask for Ifx_CBS_TRTGB_L_Bits.TG7 */
#define IFX_CBS_TRTGB_L_TG7_MSK (0xfu)

/** \brief Offset for Ifx_CBS_TRTGB_L_Bits.TG7 */
#define IFX_CBS_TRTGB_L_TG7_OFF (28u)

/** \brief Length for Ifx_CBS_TRTGB_H_Bits.TG8 */
#define IFX_CBS_TRTGB_H_TG8_LEN (4u)

/** \brief Mask for Ifx_CBS_TRTGB_H_Bits.TG8 */
#define IFX_CBS_TRTGB_H_TG8_MSK (0xfu)

/** \brief Offset for Ifx_CBS_TRTGB_H_Bits.TG8 */
#define IFX_CBS_TRTGB_H_TG8_OFF (0u)

/** \brief Length for Ifx_CBS_TRTGB_H_Bits.TG9 */
#define IFX_CBS_TRTGB_H_TG9_LEN (4u)

/** \brief Mask for Ifx_CBS_TRTGB_H_Bits.TG9 */
#define IFX_CBS_TRTGB_H_TG9_MSK (0xfu)

/** \brief Offset for Ifx_CBS_TRTGB_H_Bits.TG9 */
#define IFX_CBS_TRTGB_H_TG9_OFF (4u)

/** \brief Length for Ifx_CBS_TRTGB_H_Bits.TG10 */
#define IFX_CBS_TRTGB_H_TG10_LEN (4u)

/** \brief Mask for Ifx_CBS_TRTGB_H_Bits.TG10 */
#define IFX_CBS_TRTGB_H_TG10_MSK (0xfu)

/** \brief Offset for Ifx_CBS_TRTGB_H_Bits.TG10 */
#define IFX_CBS_TRTGB_H_TG10_OFF (8u)

/** \brief Length for Ifx_CBS_TRTGB_H_Bits.TG11 */
#define IFX_CBS_TRTGB_H_TG11_LEN (4u)

/** \brief Mask for Ifx_CBS_TRTGB_H_Bits.TG11 */
#define IFX_CBS_TRTGB_H_TG11_MSK (0xfu)

/** \brief Offset for Ifx_CBS_TRTGB_H_Bits.TG11 */
#define IFX_CBS_TRTGB_H_TG11_OFF (12u)

/** \brief Length for Ifx_CBS_TRTGB_H_Bits.TG12 */
#define IFX_CBS_TRTGB_H_TG12_LEN (4u)

/** \brief Mask for Ifx_CBS_TRTGB_H_Bits.TG12 */
#define IFX_CBS_TRTGB_H_TG12_MSK (0xfu)

/** \brief Offset for Ifx_CBS_TRTGB_H_Bits.TG12 */
#define IFX_CBS_TRTGB_H_TG12_OFF (16u)

/** \brief Length for Ifx_CBS_TRTGB_H_Bits.TG13 */
#define IFX_CBS_TRTGB_H_TG13_LEN (4u)

/** \brief Mask for Ifx_CBS_TRTGB_H_Bits.TG13 */
#define IFX_CBS_TRTGB_H_TG13_MSK (0xfu)

/** \brief Offset for Ifx_CBS_TRTGB_H_Bits.TG13 */
#define IFX_CBS_TRTGB_H_TG13_OFF (20u)

/** \brief Length for Ifx_CBS_TRTGB_H_Bits.TG14 */
#define IFX_CBS_TRTGB_H_TG14_LEN (4u)

/** \brief Mask for Ifx_CBS_TRTGB_H_Bits.TG14 */
#define IFX_CBS_TRTGB_H_TG14_MSK (0xfu)

/** \brief Offset for Ifx_CBS_TRTGB_H_Bits.TG14 */
#define IFX_CBS_TRTGB_H_TG14_OFF (24u)

/** \brief Length for Ifx_CBS_TRTGB_H_Bits.TG15 */
#define IFX_CBS_TRTGB_H_TG15_LEN (4u)

/** \brief Mask for Ifx_CBS_TRTGB_H_Bits.TG15 */
#define IFX_CBS_TRTGB_H_TG15_MSK (0xfu)

/** \brief Offset for Ifx_CBS_TRTGB_H_Bits.TG15 */
#define IFX_CBS_TRTGB_H_TG15_OFF (28u)

/** \brief Length for Ifx_CBS_IFSA_Bits.ADDR */
#define IFX_CBS_IFSA_ADDR_LEN (32u)

/** \brief Mask for Ifx_CBS_IFSA_Bits.ADDR */
#define IFX_CBS_IFSA_ADDR_MSK (0xffffffffu)

/** \brief Offset for Ifx_CBS_IFSA_Bits.ADDR */
#define IFX_CBS_IFSA_ADDR_OFF (0u)

/** \brief Length for Ifx_CBS_IFSC_Bits.GO */
#define IFX_CBS_IFSC_GO_LEN (1u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.GO */
#define IFX_CBS_IFSC_GO_MSK (0x1u)

/** \brief Offset for Ifx_CBS_IFSC_Bits.GO */
#define IFX_CBS_IFSC_GO_OFF (0u)

/** \brief Length for Ifx_CBS_IFSC_Bits.OTGS */
#define IFX_CBS_IFSC_OTGS_LEN (1u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.OTGS */
#define IFX_CBS_IFSC_OTGS_MSK (0x1u)

/** \brief Offset for Ifx_CBS_IFSC_Bits.OTGS */
#define IFX_CBS_IFSC_OTGS_OFF (1u)

/** \brief Length for Ifx_CBS_IFSC_Bits.MODE */
#define IFX_CBS_IFSC_MODE_LEN (1u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.MODE */
#define IFX_CBS_IFSC_MODE_MSK (0x1u)

/** \brief Offset for Ifx_CBS_IFSC_Bits.MODE */
#define IFX_CBS_IFSC_MODE_OFF (2u)

/** \brief Length for Ifx_CBS_IFSC_Bits.PRIO */
#define IFX_CBS_IFSC_PRIO_LEN (1u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.PRIO */
#define IFX_CBS_IFSC_PRIO_MSK (0x1u)

/** \brief Offset for Ifx_CBS_IFSC_Bits.PRIO */
#define IFX_CBS_IFSC_PRIO_OFF (3u)

/** \brief Length for Ifx_CBS_IFSC_Bits.RSREP */
#define IFX_CBS_IFSC_RSREP_LEN (4u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.RSREP */
#define IFX_CBS_IFSC_RSREP_MSK (0xfu)

/** \brief Offset for Ifx_CBS_IFSC_Bits.RSREP */
#define IFX_CBS_IFSC_RSREP_OFF (8u)

/** \brief Length for Ifx_CBS_IFSC_Bits.BM0 */
#define IFX_CBS_IFSC_BM0_LEN (2u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.BM0 */
#define IFX_CBS_IFSC_BM0_MSK (0x3u)

/** \brief Offset for Ifx_CBS_IFSC_Bits.BM0 */
#define IFX_CBS_IFSC_BM0_OFF (16u)

/** \brief Length for Ifx_CBS_IFSC_Bits.BM1 */
#define IFX_CBS_IFSC_BM1_LEN (2u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.BM1 */
#define IFX_CBS_IFSC_BM1_MSK (0x3u)

/** \brief Offset for Ifx_CBS_IFSC_Bits.BM1 */
#define IFX_CBS_IFSC_BM1_OFF (18u)

/** \brief Length for Ifx_CBS_IFSC_Bits.BM2 */
#define IFX_CBS_IFSC_BM2_LEN (2u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.BM2 */
#define IFX_CBS_IFSC_BM2_MSK (0x3u)

/** \brief Offset for Ifx_CBS_IFSC_Bits.BM2 */
#define IFX_CBS_IFSC_BM2_OFF (20u)

/** \brief Length for Ifx_CBS_IFSC_Bits.BM3 */
#define IFX_CBS_IFSC_BM3_LEN (2u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.BM3 */
#define IFX_CBS_IFSC_BM3_MSK (0x3u)

/** \brief Offset for Ifx_CBS_IFSC_Bits.BM3 */
#define IFX_CBS_IFSC_BM3_OFF (22u)

/** \brief Length for Ifx_CBS_IFSC_Bits.BM4 */
#define IFX_CBS_IFSC_BM4_LEN (2u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.BM4 */
#define IFX_CBS_IFSC_BM4_MSK (0x3u)

/** \brief Offset for Ifx_CBS_IFSC_Bits.BM4 */
#define IFX_CBS_IFSC_BM4_OFF (24u)

/** \brief Length for Ifx_CBS_IFSC_Bits.BM5 */
#define IFX_CBS_IFSC_BM5_LEN (2u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.BM5 */
#define IFX_CBS_IFSC_BM5_MSK (0x3u)

/** \brief Offset for Ifx_CBS_IFSC_Bits.BM5 */
#define IFX_CBS_IFSC_BM5_OFF (26u)

/** \brief Length for Ifx_CBS_IFSC_Bits.BM6 */
#define IFX_CBS_IFSC_BM6_LEN (2u)

/** \brief Mask for Ifx_CBS_IFSC_Bits.BM6 */
#define IFX_CBS_IFSC_BM6_MSK (0x3u)

/** \brief Offset for Ifx_CBS_IFSC_Bits.BM6 */
#define IFX_CBS_IFSC_BM6_OFF (28u)

